{
  "pers": {
    "name": "Roberto Serra",
    "natoIl": "10/06/1983",
    "basedOn": "Torino, Italy",
    "email": "obi.serra@gmail.com",
    "github": "https://github.com/obiSerra",
    "linkedin": "https://linkedin.com/in/obiserra/",
    "website": "https://www.rserra.it/",
    "kaggle": "https://www.kaggle.com/oneobi",
    "jobTitle": "Full Stack Senior Engineer"
  },

  "summary": [
    "I am a software engineer with 15 years of experience, during which I have worked with a wide array of projects, teams, clients, and technologies.",
    "I'm very passionate about technology, especially with Machine Learning and algorithms."
  ],
  "pastJobs": [
    {
      "companyName": "Etiqa",
      "jobTitle": "Director of Technology",
      "started": "Apr 2023",
      "ended": "Present",
      "description": [
        "Leading 14 Developers and DevOps divided into small teams on multiple projects while providing technical assistance and mentorship."
      ],
      "tech": "AWS CloudFormation, System Architecture, Lucid, Docker, TDD, Unit Testing, Docker"
    },
    {
      "companyName": "Etiqa",
      "jobTitle": "Software Engineer",
      "started": "Sept 2014",
      "ended": "Present",
      "description": [
        "Designing and developing enterprise and large-scale modern web applications for the US and European markets."
      ],
      "tech": "React, JavaScript, TypeScript, Python, Clojure, RabbitMQ, MongoDb, Jenkins, C#"
    },
    {
      "companyName": "Muvobit",
      "jobTitle": "Web and Mobile Developer",
      "started": "Jan 2012",
      "ended": "Aug 2014",
      "description": [
        "Developing and designing web applications, mobile apps (PhoneGap and Titanium), and HTML5 games."
      ],
      "tech": "Yii, PHP, MySQL, JavaScript, jQuery, HTML5 Canvas"
    },
    {
      "companyName": "Real.co",
      "jobTitle": "Web Developer",
      "started": "Mar 2010",
      "ended": "Dec 2011",
      "description": ["Developing and maintaining a live auction web application."],
      "projects": [],
      "tech": "PHP, HTML, CSS, JavaScript"
    }
  ],
  "others": [
    "Taught a NodeJs laboratory at Turin University for two years",
    "AI and Machine Learning practitioner (LLM, Reinforcement Learning)",
    "Unity and HTML5 game development",
    "Algorithms, coding and ML competitions",
    "Physical computing with Arduino and Raspberry PI",
    "Bread and pizza baking, cooking",
    "Science and history documentaries"
  ],
  "notableProjects": [
    {
      "title": "Solution Architect and Team Lead for Multiply Labs a San Francisco-based startup",
      "tech": "Python, AWS Lambda, AWS CloudFormation, Docker, FastApi, React, TypeScript, Software architecture, TDD, Agile, PR-reviews",
      "description": [
        "Through my dual responsibilities as a Solution Architect and Team Leader, I coordinated the engineering team's efforts, driving them toward successfully delivering an ad-hoc solution both on the cloud and locally."
      ]
    },
    {
      "title": "NodeJS Lab at Turin University",
      "tech": "Node, Git, JavaScript, TypeScript",
      "description": [
        "I taught a NodeJs laboratory at Turin University for two years. The lessons were aimed at students with basic programming experience and covered several NodeJs aspects, such as use cases, async programming, and unit test."
      ]
    },
    {
      "title": "Senior full-stack developer for the 2020 Tokyo Olympics official website",
      "tech": "C#, JavaScript, CSS, HTML, Scrum, Cypress",
      "description": [
        "I contributed to developing the primary website for the 2020 Tokyo Olympics official website, working on the front-end, the back-end, and the automation pipelines."
      ]
    },
    {
      "title": "Full-stack developer for a UHC, a US health assurance company",
      "tech": "Clojure, JavaScript, RabbitMQ, Jenkins, AngularJs, Git",
      "description": [
        "I worked as a full-stack developer on an insurance quoting web application targeted to medium and small businesses for a Fortune top 10 assurance company, refactoring an old Java monolith application into a micro-services-based one and creating an ad-hoc git flow to increase the maintainability and ease of deployment."
      ]
    },
    {
      "title": "Interactive YouTube Masthead for a Armani Code advertisement",
      "tech": "JavaScript, CSS, HTML, Canvas",
      "description": ["I created a YouTube Masthead with an interactive video optimized for mobile and desktop."]
    }
  ],
  "side_projects": [
    "Taught a NodeJs class at Turin University for two years",
    "AI and Machine Learning practitioner (LLM, Reinforcement Learning)",
    "Unity and HTML5 game development",
    "Algorithms, coding and ML competitions",
    "Physical computing with Arduino and Raspberry PI"
  ],
  "projects": [
    "Taught a NodeJs laboratory at Turin University for two years.",
    "Several car configurators for a top multinational automotive company",
    "A management tool for massive live tournaments for a US gaming card company",
    "Two multi-platform mobile applications",
    "A real-time auction web application"
  ],
  "skills": [
    [
      "TypeScript, JavaScript, Python, C#, Clojure, PHP",
      "FastApi, Pydantic, Asyncio, Pytorch, Pandas, Numpy, Scikit-learn, Matplotlib, Seaborn",
      "React, Redux, NodeJs, Express.js, Tailwind CSS",
      "AWS Lambda, S3, CloudFormation, Cognito, APIGateway, AWS SQS, Google Cloud Provider",
      "DynamoDb, MongoDb, MySQL, PostgreSQL",
      "Git, bash, ssh, MacOS, Linux, Jenkins, Docker, RabbitMQ",
      "Unit-Testing, TDD, E2E testing, Cypress, Jest",
      "Agile and Scrum, PR-reviews"
    ],
    [
      "Very strong communication skills",
      "Great experience as a team leader and department director",
      "Excellent problem-solving abilities, capable of finding practical solutions",
      "Great at adapting to different situations and project requirements",
      "Quick and eager learner, committed to continuous self-improvement"
    ]
  ],
  "languages": [
    {
      "language": "Italian",
      "level": "Native"
    },
    {
      "language": "English",
      "level": "Fluent"
    }
  ],
  "educations": [
    {
      "name": "Università degli Studi di Torino",
      "qualification": "Laurea in Scienze Della Comunicazione - Bachelor of Arts in Communication Studies",
      "when": "2007"
    }
  ]
}
