{
  "pers": {
    "name": "Roberto Serra",
    "natoIl": "10/06/1983",
    "basedOn": "Torino, Italy",
    "email": "obi.serra@gmail.com",
    "github": "https://github.com/obiSerra",
    "linkedin": "https://www.linkedin.com/in/obiserra/",
    "website": "https://www.rserra.it/",
    "jobTitle": "Full Stack Senior Engineer"
  },

  "summary": [
    "I am a software developer with 15 years of experience, during which I have worked with a wide array of projects, teams, clients, and technologies.",
    "I'm passionate about creating innovative solutions to complex problems while learning."
  ],
  "pastJobs": [
    {
      "companyName": "Etiqa SRL",
      "jobTitle": "Tech Lead and Senior Software Engineer",
      "started": "Sept 2014",
      "ended": "Present",
      "description": [
        "Designing and developing enterprise and large-scale modern web applications for the US and European markets."
      ],
      "tech": "React, JavaScript, TypeScript, Python, Clojure, RabbitMQ, MongoDb, Jenkins, C#, AWS"
    },
    {
      "companyName": "Muvobit",
      "jobTitle": "Web and Mobile Developer",
      "started": "Jan 2012",
      "ended": "Aug 2014",
      "description": [
        "Developing and designing web applications, mobile apps (PhoneGap and Titanium), and HTML5 games."
      ],
      "tech": "Yii, PHP, MySQL, JavaScript, jQuery, HTML5 Canvas"
    },
    {
      "companyName": "Collettivo Wip",
      "jobTitle": "Co-founder and Developer",
      "started": "Mar 2010",
      "ended": "Dec 2011",
      "description": ["Developing web sites and web applications for small and medium-sized companies."],
      "tech": "WordPress, Joomla, PHP, HTML, CSS, JavaScript"
    },
    {
      "companyName": "Real.co",
      "jobTitle": "Web Developer",
      "started": "Mar 2010",
      "ended": "Dec 2011",
      "description": ["Developing and maintaining a live auction web application."],
      "projects": [],
      "tech": "PHP, HTML, CSS, JavaScript"
    }
  ],
  "others": [
    "AI and Machine Learning enthusiast (LLM, Reinforcement Learning)",
    "Unity and HTML5 game development",
    "Algorithms, coding and ML competitions",
    "Physical computing with Arduino and Raspberry PI",
    "Bread and pizza baking, cooking",
    "Science and history documentaries"
  ],
  "notableProjects": [
    {
      "title": "Solution Architect and Team Lead for a San Francisco-based startup",
      "tech": "Python, AWS Lambda, AWS CloudFormation, Docker, FastApi, React, TypeScript, Software architecture, TDD, Agile, PR-reviews",
      "description": [
        "Through my dual responsibilities as a Solution Architect and Team Leader, I coordinated the engineering team's efforts, driving them toward successfully delivering an ad-hoc solution both on the cloud and locally."
      ]
    },
    {
      "title": "Senior full-stack developer for a worldwide sport event",
      "tech": "C#, JavaScript, CSS, HTML, Scrum, Cypress",
      "description": [
        "I contributed to developing the primary website for a prestigious global sports event scheduled for 2020 (subsequently postponed to 2021), working on the front-end, the back-end, and the automation pipelines."
      ]
    },
    {
      "title": "Full-stack developer for a US health assurance company",
      "tech": "Clojure, JavaScript, RabbitMQ, Jenkins, AngularJs, Git",
      "description": [
        "I worked as a full-stack developer on an insurance quoting web application targeted to medium and small businesses for a Fortune top 10 assurance company, refactoring an old Java monolith application into a micro-services-based one and creating an ad-hoc git flow to increase the maintainability and ease of deployment."
      ]
    },
    {
      "title": "Interactive YouTube Masthead for an Italian fashion brand",
      "tech": "JavaScript, CSS, HTML, Canvas",
      "description": ["I created a YouTube Masthead with an interactive video optimized for mobile and desktop."]
    }
  ],
  "projects": [
    "Taught a NodeJs laboratory at Turin University for two years.",
    "Several car configurators for a top multinational automotive company",
    "A management tool for massive live tournaments for a US gaming card company",
    "Two multi-platform mobile applications",
    "A real-time auction web application"
  ],
  "skills": [
    [
      "JavaScript, TypeScript, Python, Clojure, C#, PHP",
      "React, Redux, NodeJs, Express.js, Jest",
      "FastApi, Flask, Pydantic, Asyncio, Luminus",
      "DynamoDb, MongoDb, MySQL, PostgreSQL",
      "AWS Lambda, S3, CloudFormation, Cognito, APIGateway, AWS SQS, Google Cloud Provider",
      "Pandas, Pytorch, Unity, Unity ML-Agents, Prompt Engineering",
      "Git, bash, ssh, MacOS, Linux, Jenkins, Docker, RabbitMQ",
      "Unit-Testing, TDD, E2E testing, Agile, Jira, PR-reviews"
    ],
    [
      "Very strong communication skills",
      "Great experience as a team leader and department director",
      "Excellent problem-solving abilities, capable of finding practical solutions",
      "Great at adapting to different situations and project requirements",
      "Quick and eager learner, committed to continuous self-improvement"
    ]
  ],
  "languages": [
    {
      "language": "Italian",
      "level": "Native"
    },
    {
      "language": "English",
      "level": "Fluent"
    }
  ],
  "educations": [
    {
      "name": "Università degli Studi di Torino",
      "qualification": "Laurea in Scienze Della Comunicazione - Bachelor of Arts in Communication Studies",
      "when": "2007"
    }
  ]
}
